xmlsamples/DAS_Query/PROD-PH-GetCountriesCurrencies-AIS-PH647.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xrsi="http://www.westernunion.com/schema/xrsi" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Header/>
   <soapenv:Body>
      <xrsi:h2h-das-request>
         <channel>
            <type>H2H</type>
            <name>USSC</name>
            <version>9500</version>
         </channel>
         <foreign_remote_system>
            <identifier>WGHHPH6471P</identifier>
            <reference_no>29997000141024240</reference_no>
            <counter_id>PH647PP0023G</counter_id>
         </foreign_remote_system>
         <client_id>H2H</client_id>
         <name>GetCountriesCurrencies</name>
         <filters>
            <queryfilter1>en</queryfilter1>
            <queryfilter2>PH PHP</queryfilter2>
         </filters>
      </xrsi:h2h-das-request>
   </soapenv:Body>
</soapenv:Envelope>