xmlsamples/DAS_Query/PI-KR-GetCountriesCurrencies-AIS-KRR60.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xrsi="http://www.westernunion.com/schema/xrsi" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Header/>
   <soapenv:Body>
      <xrsi:h2h-das-request>
         <channel>
            <type>H2H</type>
            <name>KTB</name>
            <version>9500</version>
         </channel>
         <foreign_remote_system>
            <identifier>WGHHKRR600T</identifier>
            <reference_no>12345</reference_no>
            <counter_id>KRR60ARP001A</counter_id>
         </foreign_remote_system>
         <client_id>H2H</client_id>
         <name>GetCountriesCurrencies</name>
         <account_num>AHH384478</account_num>
         <filters>
            <queryfilter1>en</queryfilter1>
            <queryfilter2>TW USD</queryfilter2>
         </filters>
      </xrsi:h2h-das-request>
   </soapenv:Body>
</soapenv:Envelope>